import React from "react";
import FAQItem from "./FAQItem";

const FAQ = () => {
  const list = [
    {
      question: "سفارشم کی میرسه دستم؟",
      answer:
        "تموم سفارش های شما بعد از ثبت به دردسترس ترین ادمین اطلاع داده میشه تا برای شما پرداخت انجام بشه و محصلوتون رو تحویل بدیم. ولی یادتون نره که محصول های تحویل فوری بلافاصله بعد از ثبت سفارش تحویلتون میشه و میتونین ازش استفاده کنین",
    },
    {
      question: "اکانت یا گیفت کارت سفارشی هم دارین؟",
      answer:
        "بله.شما میتونین محصولی که نیاز دارین رو توی صفحه ی سفارش اختصاصی برامون بنویسین تا ما بررسی کنیم و توی سریع ترین زمان بهتون اعلام هزینه کنیم و پس از پرداخت شما براتون محصولتون تحویلش ",
    },
    {
      question: "زمان تحویل سفارش ها چه قدره؟",
      answer:
        "هدف ما اینه که سفارش های شما رو توی کمتر از ۲ - ۳ ساعت تحویلتون بدیم، ولی خب اگه خیلی سرمون شلوغ باشه یا مشکل فنی پیش بیاد این زمان ممکنه چند ساعتی بهش اضافه بشه نگرانی نداره شما همیشه میتونین با تیم پشتیبانی ما در تماس باشین و از آخرین وضعیت سفارشتون مطلع بشین، البته که صفحه پیگیری سفارش جای بهتری برای دیدن وضعیت سفارش هاست",
    },
    {
      question: "چطور هزینه سفارش رو پرداخت کنم؟",
      answer:
        "شما میتونین با تموم کارت های بانکی عضو شتاب هزینه سفارشتونو پرداخت کنین، راستی اگه دوست ندارین با کارت بانکی پرداخت کنین میتونین با پشتیبانی تماس بگیرین تا راه های دیگه پرداخت سفارش رو بهتون بگن",
    },
  ];
  return (
    <div className="FAQ">
      <p className="FAQ__title">----------سوالات پر تکرار----------</p>
      {list.map((item) => (
        <FAQItem question={item.question} answer={item.answer} />
      ))}
    </div>
  );
};

export default FAQ;
